[
    {
        "id": 2,
        "name": "Meu Bolso Online",
        "subTitle": "Aplicação para gestão de despesas pessoais, desenvolvida com Node.js e hospedada gratuitamente no Fly.io.",
        "description": "Meu Bolso Online é uma aplicação simples e eficiente para ajudar os usuários a gerenciar suas despesas mensais. O sistema permite o cadastro rápido, registro de despesas, e fornece uma visão abrangente dos gastos mensais, com um foco em usabilidade e acessibilidade. A hospedagem é feita no Fly.io, garantindo acesso rápido e seguro, enquanto o banco de dados PostgreSQL gerencia todas as informações de forma confiável.",
        "technicalDetails": "O projeto utiliza tecnologias modernas como Node.js, Express.js, Sequelize ORM para gerenciamento de banco de dados, bcrypt para segurança das senhas, e jQuery para manipulação dinâmica no front-end. O design é construído com HTML5, CSS3 e Bootstrap, garantindo uma interface responsiva e amigável. O banco de dados é gerenciado pelo PostgreSQL, e o versionamento das tabelas é feito com Sequelize CLI, incluindo comandos como `db:create`, `db:migrate` e `db:seed:all` para configuração rápida e eficiente.",
        "images": [
            {"url": "home-footer-mbo.png", "alt": "Tela do dashboard com resumo de despesas"},
            {"url": "home-mbo.png", "alt": "Tela de registro de novas despesas"},
            {"url": "profile-mbo-2.png", "alt": "Tela de cadastro de novos usuários"},
            {"url": "profile-mbo.png", "alt": "Tela de cadastro de novos usuários"}
        ],
        "movie": {
            "link": "https://www.youtube.com/embed/a37eKxuTn3E?si=LMhIibizpX_lBHaN",
            "title": "Demonstração do Projeto Meu Bolso Online",
            "text": "Este vídeo apresenta o projeto Meu Bolso Online, uma aplicação desenvolvida com Node.js e hospedada no Fly.io. A demonstração cobre recursos principais, como cadastro de usuários, registro de despesas mensais, e a visão geral dos gastos em um dashboard intuitivo. O vídeo também destaca o uso de tecnologias modernas e a integração com o banco de dados PostgreSQL."
        },
        "url_video_projetc": "",
        "url_projeto": "https://mbo-frontend-nameless-sun-8096.fly.dev",
        "url_repositorio": "https://github.com/CodeWizardMyke/mbo-front-end.git",
        "url_download": "https://github.com/CodeWizardMyke/mbo-front-end/archive/refs/heads/master.zip"
    },
    {
        "id": 1,
        "name": "DH Book Store",
        "subTitle": "E-commerce de livros desenvolvido com Node.js e Express.js, utilizando metodologias ágeis e padrões de arquitetura.",
        "description": "O DH Book Store é um site de vendas de livros construído com Node.js e Express.js, seguindo metodologias ágeis como Scrum e utilizando o padrão MVC para controle de dados. O projeto também funciona como uma API, acessível via rotas autenticadas com tokens JWT. Ele oferece funcionalidades como cadastro de usuários (clientes e funcionários), produtos e gerenciamento de dados através de uma plataforma simples para administradores. O pagamento é integrado com a API de checkout do Mercado Pago e o envio é terceirizado. Adicionalmente, o sistema consome a API do ViaCEP para simplificar o preenchimento de endereços.",
        "technicalDetails": "Este projeto utiliza Sequelize para gerenciamento do banco de dados, com suporte ao versionamento através do Sequelize CLI, permitindo criar, migrar e popular tabelas com os comandos `db:create`, `db:migrate` e `db:seed:all`. Para segurança e privacidade, o JWT é usado na criptografia dos dados do usuário. A aplicação também consome APIs externas, como ViaCEP, para melhorar a experiência do usuário.",
        "images": [
            {"url": "carrinho.png", "alt": "Tela do carrinho de compras"},
            {"url": "home.png", "alt": "Tela inicial do site"},
            {"url": "produto.png", "alt": "Página de detalhes do produto"}
        ],
        "movie":{
            "link":"https://www.youtube.com/embed/mkT1SaJmAyY?si=_jvfa2aiscrkKRsN",
            "title":"Demonstração do Projeto DH Book Store",
            "text":"Este vídeo apresenta uma visão geral do projeto DH Book Store, um e-commerce desenvolvido com Node.js e Express.js. A demonstração inclui funcionalidades principais, como o fluxo de cadastro de usuários, gerenciamento de produtos, e o processo de finalização de compras com a integração de APIs como Mercado Pago e ViaCEP. O objetivo é proporcionar uma visão clara do funcionamento do site e de sua interface intuitiva, ideal para usuários finais e administradores."
        },
        "url_video_projetc":"",
        "url_projeto": "https://bookstore-digital-society.fly.dev",
        "url_repositorio": "https://github.com/CodeWizardMyke/booking_store_back",
        "url_download": "https://github.com//CodeWizardMyke/booking_store_back/archive/refs/heads/master.zip"
    }
]